# Critical Thinking 1 

## Data Processing

<br>
Course Code: DS560 <br>
Course Name: Advanced Data Mining <br>
CRN: 24539
Dr. Mohammad Abdelrahman

Student ID: G200007615 <br>
Student Name: Abdulaziz Alqumayzi<br>
Date: 07/02/2021

#### Requirements 
- Colab or Jupyter notebook to run the code.
- Pandas package.

## Table of contents:
- [Task-2](#task2)
- [Task-3](#task3)
- [Task-4](#task4)
- [Task-5](#task5)
- [References](#ref)

In [1]:
# import pandas to complete our Data Processing
import pandas as pd

<a id='task2'></a>
#### Task-2: 
Read the data from the  employee_data.csv file and extract the employee first name, employee last name, department name, and number of years of employment from the file.

In [2]:
# reading and extracting the csv file
df = pd.read_csv('employee_data.csv')
df

    first_name       last_name year                 department
0         Joan  Hamilton-Huber    2                          HR
1       Nathan         Brigmon    5      Austin Code Department
2        Shawn         Lincoln    8                         NaN
3        Chris       Hernandez  NaN    Austin Convention Center
4          NaN             NaN    7               Austin Energy
..         ...             ...  ...                         ...
138     Thomas      Montgomery    8    Austin Resource Recovery
139     Thomas      Montgomery  NaN                          HR
140      Angel          Flores  NaN                         IT
141      Tyler               ?    9  Office of the City Auditor
142      Diana          Martin    6                          HR

[143 rows x 4 columns]

<a id='task3'></a>
#### Task-3: 
Convert the extracted data to a pandas dataframe, called “Employee”, whose columns are “FirstName”, “LastName”, “Year” and “Department”.

In [3]:
# creating a copy from df into Employee dataframe
Employee = df.copy()
# Employee already a dataframe so no need to convert it 
type(Employee)

pandas.core.frame.DataFrame

In [4]:
# renaming columns in the shortest ways
# note: all columns must be changed or assigned to it using this way or you will get an error
Employee.columns = ['FirstName', 'LastName', 'Year' ,'Department']
Employee

    FirstName        LastName Year                  Department
0        Joan  Hamilton-Huber    2                          HR
1      Nathan         Brigmon    5      Austin Code Department
2       Shawn         Lincoln    8                         NaN
3       Chris       Hernandez  NaN    Austin Convention Center
4         NaN             NaN    7               Austin Energy
..        ...             ...  ...                         ...
138    Thomas      Montgomery    8    Austin Resource Recovery
139    Thomas      Montgomery  NaN                          HR
140     Angel          Flores  NaN                         IT
141     Tyler               ?    9  Office of the City Auditor
142     Diana          Martin    6                          HR

[143 rows x 4 columns]

<a id='task4'></a>
#### Task-4: 
Find the number of missing values in each column, then replace missing values in any column with the most frequent value in this column (Note: “?” is considered as a missing value).

In [5]:
# checking null values in each column
Employee.isnull().sum()

FirstName     13
LastName      14
Year          22
Department    12
dtype: int64

We have 13 missing values in the FirstName column, 14 in LastName, 22 in Year, and 12 in Department. <br>
Next, we will check if there are error typing and wrong entered values.

In [6]:
# check all values in the 'FirstName' column
Employee['FirstName'].unique()

array(['Joan', 'Nathan', 'Shawn', 'Chris', nan, 'Christine', 'Gus', 'Ron',
       'Paige', 'Stefan', 'Joe', 'Bryce', 'Sarah', 'Gabriel', 'Patricia',
       'Patti', 'Robert', 'Korrie', 'Grace', 'Kathryn', 'Ashlee',
       'Ashley', 'Sara', 'Zachary', 'Julia', 'Melissa', 'David', 'Lynn',
       'Patrick', '?', 'Tyler', 'Perry', 'Daniel', 'Richard', 'Yanira',
       'John', 'Gavin', 'Tomas', 'Jim', 'Jonathan', 'Josh', 'Katy',
       'Jamila', 'Kimberly', 'Farah', 'Liz', 'Zach', 'Kristi', 'Jeff',
       'Micheal', 'Sam', 'Bryan', 'Megan', 'Blender', 'Jesse', 'Gail',
       'Thomas', 'Angel', 'Diana ', 'First Name', 'Brian', 'Diana'],
      dtype=object)

In `FirstName` column, there are two errors: 
- ?
- First Name

In [7]:
# checking the ? value by filtering the dataframe
Employee[Employee['FirstName']== '?']

    FirstName LastName Year      Department
33          ?      NaN  NaN   Equity Office
76          ?  Lambert    2   Austin Energy
111         ?   Walker    1  LAW Department

In index 33, most of the data wrong so it will be removed later

In [8]:
# checking the 'First Name' value by filtering the dataframe
Employee[Employee['FirstName'] == 'First Name']

     FirstName   LastName Year  Department
71  First Name  Last Name  NaN  Department

This row has no meaning, maybe came from a system error

In [9]:
# check all values in the 'LirstName' column
Employee['LastName'].unique()

array(['Hamilton-Huber', 'Brigmon', 'Lincoln', 'Hernandez', nan, 'Thies',
       'Delgado', 'MacKay', 'Warner', 'Wray', 'Faulk', 'Benton', 'Cronin',
       'Gonzalez', 'Genty-Andrade', 'Edwards', 'Bizendine', 'Johnson',
       'Kretchmer', 'Darnall', 'Harris', 'Parsons', 'Behunek', 'Ashburn',
       'Robbins', 'Alvarado', 'Andersen', 'Cohee', 'Murphy', 'Higdon',
       'Perez', 'Honker', 'Bailey', 'Oliveras', 'Walker', 'Lambert',
       'Salinas', 'Warren', 'Tomko', 'Rudow', 'Zamesnick', 'Siller',
       'Olivares', 'Muscadin', 'Hargrove', 'Baumer', 'Samilpa', 'Hayes',
       'Nixon', 'Strycharske', 'Tedford', 'Thompson', 'Bell', 'Hill',
       'Rodriguez', 'Speirs', 'Ray', 'Clayton', 'Montgomery', 'Flores',
       'Myers', 'Martin', 'Last Name', '?', 'Long'], dtype=object)

In LastName column, there are two errors: 
- ?
- Last Name

In [10]:
# checking the ? value by filtering the dataframe
Employee[Employee['LastName']== '?']

    FirstName LastName Year                      Department
86    Gabriel        ?    2        Austin Resource Recovery
121       Liz        ?    4  Office of Real Estate Services
141     Tyler        ?    9      Office of the City Auditor

In [11]:
# checking the 'LastName' value by filtering the dataframe
Employee[Employee['LastName']== 'Last Name']

     FirstName   LastName Year  Department
71  First Name  Last Name  NaN  Department

In [12]:
# making sure that there is a first name and the last name is not two names 
Employee[Employee['LastName']== 'Hamilton-Huber']

   FirstName        LastName Year              Department
0       Joan  Hamilton-Huber    2                      HR
72      Joan  Hamilton-Huber    5  Animal Services Office

In [13]:
# making sure that there is a first name and the last name is not two names
Employee[Employee['LastName']== 'Genty-Andrade']

   FirstName       LastName Year            Department
15  Patricia  Genty-Andrade    8  Austin Water Utility
87  Patricia  Genty-Andrade    3                    HR

Again, this row will be removed later

In [14]:
# check all values in the 'Year' column
Employee['Year'].unique()

array(['2', '5', '8', nan, '7', '3', '4', '9', '6', '1', '?'],
      dtype=object)

In Year column, there is one error: 
- ?

In [15]:
# checking the ? value by filtering the dataframe
Employee[Employee['Year']== '?']

    FirstName  LastName Year               Department
63       John    Speirs    ?                      IT
83        Joe     Faulk    ?    Austin Public Library
105       NaN       NaN    ?            Equity Office
130     Bryan  Thompson    ?  Public Works Department

Index 105 to be removed later because most of the data are missing in this row

In [16]:
# check all values in the 'Department' column
Employee['Department'].unique()

array(['HR', 'Austin Code Department', nan, 'Austin Convention Center',
       'Austin Energy', 'IT ', 'Austin Fire', 'Austin Police Department',
       'Austin Public Health', 'Austin Public Library',
       'Austin Resource Recovery', 'Austin Water Utility',
       'Budget Office', 'Capital Contracting Office',
       'City Clerks Office', 'Communications & Public Information Office',
       "Controller's Office", 'Corridor Program Implementation Office',
       'Development Service Department',
       'Downtown Austin Community Court', 'Economic Development',
       'Emergency Medical Services', 'Equity Office', 'Fleet Services',
       'Innovation Office', 'Intergovernmental Relations',
       'Labor Relations', 'LAW Department', 'Municipal Court\xa0',
       'Municipal Court Judge',
       'Neighborhood Housing and Community Development', 'Office of CFO',
       'Office of Performance Management', 'Office of Police Monitor',
       'Office of Real Estate Services', 'Office of the City Auditor',
       'Office of the City Manager', 'Office of the Medical Director',
       'Parks & Recreation Department', 'Planning and Zoning',
       'Project Systems Intelligence Office (?)',
       'Public Works Department', 'Purchasing Office',
       'Small & Minority Business Resources',
       'Telecom & Regulatory Affairs', 'Treasury Office',
       'Watershed Protection',
       'Homeland Security and Emergency Management', 'Department',
       'Animal Services Office', 'Mayor & Council', 'Aviation Department',
       '?', 'Building Services', 'Communications & Technology Management',
       'Human Resources Department', 'Municipal Court',
       'Office of Sustainability'], dtype=object)

In Department column, there are four errors: 
- Project Systems Intelligence Office (?)
- Municipal Court\xa0
- ?
- Human Resources Department

In [17]:
# checking the 'Project Systems Intelligence Office (?)' value by filtering the dataframe
Employee[Employee["Department"]== 'Project Systems Intelligence Office (?)']

    FirstName  LastName Year                               Department
57    Gabriel  Gonzalez    6  Project Systems Intelligence Office (?)
129     Brian      Long    5  Project Systems Intelligence Office (?)

The name of this department is ok but (?) will be removed

In [18]:
# checking the ? value by filtering the dataframe
Employee[Employee["Department"]== '?']

    FirstName   LastName Year Department
89     Robert  Bizendine  NaN          ?
124   Gabriel   Gonzalez    7          ?
131     Megan       Bell    3          ?
137    Robert    Clayton    7          ?

In [19]:
# checking \xa0 value by filtering the dataframe
Employee[Employee['Department']== 'Municipal Court\xa0' ]

   FirstName LastName Year        Department
40     Gavin  Lambert    1  Municipal Court
41     Tomas  Salinas    3  Municipal Court

\xa0 is actually non-breaking space in Latin1 (ISO 8859-1), also chr(160). You should replace it with a space.<br>
[Explanation of \xa0](https://stackoverflow.com/questions/10993612/how-to-remove-xa0-from-string-in-python#:~:text=%5Cxa0%20is%20actually%20non%2Dbreaking,by%201%20to%204%20bytes.)

In [20]:
Employee[Employee['Department']== 'Municipal Court' ]

    FirstName LastName Year       Department
113     Tomas  Salinas  NaN  Municipal Court

The rows above should be the same department, but there is something wrong. The text \xa0 will be removed

Next, checking the most frequent value in each column. The most frequent value will be replaced with missing values and ? sign

In [21]:
Employee['FirstName'].value_counts()

John          5
Tyler         4
Gabriel       4
Thomas        4
Robert        4
             ..
Kristi        1
Brian         1
First Name    1
Diana         1
Diana         1
Name: FirstName, Length: 61, dtype: int64

In [22]:
Employee['LastName'].value_counts()

Montgomery    4
?             3
Gonzalez      3
Johnson       3
Lambert       3
             ..
Long          1
Last Name     1
Hargrove      1
Samilpa       1
Myers         1
Name: LastName, Length: 64, dtype: int64

In [23]:
Employee['Year'].value_counts()

4    15
2    15
3    14
7    14
5    13
6    13
9    12
8    12
1     9
?     4
Name: Year, dtype: int64

In [24]:
Employee['Department'].value_counts()

HR                                                15
IT                                                13
Emergency Medical Services                         4
Office of the City Auditor                         4
Austin Resource Recovery                           4
Austin Public Library                              4
?                                                  4
City Clerks Office                                 3
Austin Fire                                        3
Office of Performance Management                   2
Small & Minority Business Resources                2
Economic Development                               2
Capital Contracting Office                         2
Austin Public Health                               2
Municipal Court                                    2
Austin Convention Center                           2
Office of the Medical Director                     2
Treasury Office                                    2
Municipal Court Judge                              2
Project Systems Intelligence Office (?)            2
Fleet Services                                     2
Office of CFO                                      2
Austin Energy                                      2
Development Service Department                     2
Downtown Austin Community Court                    2
Office of Real Estate Services                     2
Austin Code Department                             2
Equity Office                                      2
Corridor Program Implementation Office             2
Intergovernmental Relations                        2
LAW Department                                     2
Innovation Office                                  2
Austin Police Department                           2
Purchasing Office                                  2
Telecom & Regulatory Affairs                       2
Neighborhood Housing and Community Development     2
Public Works Department                            2
Parks & Recreation Department                      2
Budget Office                                      1
Human Resources Department                         1
Watershed Protection                               1
Communications & Technology Management             1
Mayor & Council                                    1
Labor Relations                                    1
Communications & Public Information Office         1
Office of Sustainability                           1
Homeland Security and Emergency Management         1
Controller's Office                                1
Austin Water Utility                               1
Office of the City Manager                         1
Aviation Department                                1
Planning and Zoning                                1
Building Services                                  1
Office of Police Monitor                           1
Animal Services Office                             1
Department                                         1
Municipal Court                                    1
Name: Department, dtype: int64

## Cleaning

#### Drop rows that have a lot of missing values

In [25]:
# remove rows than useless 
Employee.drop(index=[33,71,105], inplace=True)

In [26]:
# making sure that only 3 rows removed since we have 143 rows
Employee.shape

(140, 4)

#### Correct wrong values

In [27]:
# changing values in the Department column for consistency
# the replace function can change more than one value when using a dictionary
Employee['Department']= Employee['Department'].replace(
    {'Project Systems Intelligence Office (?)':'Project Systems Intelligence Office','Municipal Court\xa0':'Municipal Court',
    'IT ':'IT'})

While I was working on **task-5**, the IT department has space after the text 'IT ', that's why I'm changing it here

In [28]:
# making sure that the values are changed  
Employee[Employee["Department"]== 'Project Systems Intelligence Office (?)']

Empty DataFrame
Columns: [FirstName, LastName, Year, Department]
Index: []

In [29]:
# making sure that the values are changed 
Employee[Employee["Department"]== 'Project Systems Intelligence Office']

    FirstName  LastName Year                           Department
57    Gabriel  Gonzalez    6  Project Systems Intelligence Office
129     Brian      Long    5  Project Systems Intelligence Office

In [30]:
# making sure that the values are changed 
Employee[Employee['Department']== 'Municipal Court\xa0']

Empty DataFrame
Columns: [FirstName, LastName, Year, Department]
Index: []

In [31]:
# making sure that the values are changed 
Employee[Employee['Department']== 'Municipal Court']

    FirstName LastName Year       Department
40      Gavin  Lambert    1  Municipal Court
41      Tomas  Salinas    3  Municipal Court
113     Tomas  Salinas  NaN  Municipal Court

In [32]:
# making sure that the rows are 140
Employee.shape

(140, 4)

#### Filling the missing values 'nan' and '?'
Updating the missing values with the most frequent value in each column

In [33]:
Employee['FirstName'] = Employee['FirstName'].replace('?','John')

In [34]:
Employee['FirstName'] = Employee['FirstName'].fillna('John')

In [35]:
Employee['LastName'] = Employee['LastName'].replace('?','Montgomery')

In [36]:
Employee['LastName'] = Employee['LastName'].fillna('Montgomery')

In [37]:
Employee['Year'] = Employee['Year'].replace('?',2)

In [38]:
Employee['Year'] = Employee['Year'].fillna(2)

In [39]:
# changing the type of 'Year' column from an object into a numeric 
Employee['Year'] = pd.to_numeric(Employee['Year'])

The column data type should be checked as the first step of any investigation on a file. But I noticed that the `Year` column is an object type while I want to use `mean()` function in **task-5**. This is the reason I'm changing it now.

In [40]:
Employee['Department'] = Employee['Department'].replace({'?':'HR','Human Resources Department':'HR'})

In [41]:
Employee['Department'] = Employee['Department'].fillna('HR')

In [42]:
# making sure that the Employee dataframe has no missing values
Employee.isnull().sum()

FirstName     0
LastName      0
Year          0
Department    0
dtype: int64

In [43]:
# making sure that the rows are 140
Employee.shape

(140, 4)

In [44]:
# Checking if there are any duplicate rows
Employee.duplicated().sum()

3

In [45]:
# removing duplicate rows
Employee.drop_duplicates(inplace=True)

In [46]:
# making sure that the rows are 137
Employee.shape

(137, 4)

Employee dataframe now is cleaned

<a id='task5'></a>
#### Task-5: 
Find a list of unique names of all employees who work in the HR department . Find the average number of service years of all employees who work in the IT department.

The answer to the first question

In [47]:
# making a filter on HR department called filt
filt = Employee['Department'] == 'HR'

In [48]:
'''accessing the filter on 'FirstName' with the help of loc function 
   and using the unique function to return every unique first names in HR department'''
Employee.loc[filt, 'FirstName'].unique().tolist()

['Joan',
 'Shawn',
 'John',
 'Stefan',
 'Sarah',
 'Korrie',
 'Zachary',
 'Perry',
 'Kimberly',
 'Megan',
 'Thomas',
 'Diana ',
 'Bryce',
 'Patricia',
 'Robert',
 'Ashlee',
 'David',
 'Gavin',
 'Jonathan',
 'Farah',
 'Gabriel',
 'Jesse',
 'Diana']

In [49]:
# another way to filter and use the unique function in one code applied to 'LastName'
Employee[Employee['Department']== 'HR']["LastName"].unique().tolist()

['Hamilton-Huber',
 'Lincoln',
 'Montgomery',
 'Wray',
 'Cronin',
 'Johnson',
 'Ashburn',
 'Perez',
 'Olivares',
 'Nixon',
 'Bell',
 'Martin',
 'Benton',
 'Genty-Andrade',
 'Bizendine',
 'Harris',
 'Andersen',
 'Lambert',
 'Tomko',
 'Muscadin',
 'Gonzalez',
 'Rodriguez',
 'Clayton']

The answer to the second question

In [50]:
# making a filter on HR department called filt2
filt2 = Employee['Department'] == 'IT'

In [51]:
print('The average number of service years of all employees who work in the IT department:',Employee.loc[filt2, 'Year'].mean())

The average number of service years of all employees who work in the IT department: 5.384615384615385

<a id='ref'></a>
#### References
- Madhavan, S. (2015). Mastering Python for data science explore the world of data science through Python and learn how to make sense of data. Birmingham: Packt Publ.
-Schafer, C. (2020). Python Pandas Tutorial. Retrieved February 07, 2021, from https://www.youtube.com/watch?v=ZyhVh-qRZPA&amp;list=PL-osiE80TeTsWmV9i9c58mdDCSskIFdDS&amp;index=1&amp;ab_channel=CoreySchafer